Repository: drdrummie/CSSGnomme-ZorinOS18
Catalog: po/*.po
Languages: hr

source: Extract Colors from Background
hr: Izvuci boje iz pozadine

source: Enable GTK Theme Overlay
hr: Omogući GTK temu prekrivanja

source: Apply Overlay Changes
hr: Primijeni promjene prekrivanja

source: Open Settings
hr: Otvori postavke

source: Colors extracted and applied from background image
hr: Boje izvučene i primijenjene iz pozadinske slike

source: No background image found or unable to extract colors
hr: Nije pronađena pozadinska slika ili nije moguće izvući boje

source: Error extracting colors:
hr: Greška pri izvlačenju boja:

source: Overlay theme is not enabled
hr: Tema prekrivanja nije omogućena

source: Overlay theme updated successfully
hr: Tema prekrivanja uspješno ažurirana

source: Failed to update overlay theme
hr: Neuspjelo ažuriranje teme prekrivanja

source: Error:
hr: Greška:

source: Overlay theme created and activated
hr: Tema prekrivanja stvorena i aktivirana

source: Failed to create overlay theme
hr: Neuspjelo stvaranje teme prekrivanja

source: Error enabling overlay:
hr: Greška pri omogućavanju prekrivanja:

source: Overlay theme disabled
hr: Tema prekrivanja onemogućena

source: Overlay theme recreated and applied
hr: Tema prekrivanja ponovno stvorena i primijenjena

source: Overlay theme recreated (enable to apply)
hr: Tema prekrivanja ponovno stvorena (omogućite za primjenu)

source: Failed to recreate overlay
hr: Neuspjelo ponovno stvaranje prekrivanja

source: Theme Overlay
hr: Tema prekrivanja

source: Theme Integration
hr: Integracija teme

source: CSS Gnomme creates a dynamic overlay theme that sits on top of your current theme
hr: CSS Gnomme stvara dinamičku temu prekrivanja koja se nalazi iznad vaše trenutne teme

source: Enable Overlay Theme
hr: Omogući temu prekrivanja

source: Activate CSS Gnomme overlay with custom styling and color extraction
hr: Aktiviraj CSS Gnomme prekrivanje s prilagođenim stilom i izvlačenjem boja

source: Base Theme
hr: Osnovna tema

source: Select the theme to use as foundation for overlay
hr: Odaberite temu koja će se koristiti kao temelj za prekrivanje

source: Overlay Status
hr: Status prekrivanja

source: Checking...
hr: Provjera...

source: Inactive - Enable overlay to apply custom theme
hr: Neaktivno - Omogućite prekrivanje za primjenu prilagođene teme

source: Enable Zorin OS Integration
hr: Omogući integraciju Zorin OS-a

source: Syncs panel settings with Zorin Taskbar (margin, border radius, opacity). For Fluent-based themes, adds Zorin-style floating panel enhancements and modern aesthetics.
hr: Sinkronizira postavke panela sa Zorin Taskbarom (margina, radijus obruba, neprozirnost). Za Fluent teme, dodaje Zorin poboljšanja plutajućeg panela i modernu estetiku.

source: Auto-detect theme border radius
hr: Automatski otkrij radijus obruba teme

source: Automatically detect and use border-radius from current theme
hr: Automatski otkrijte i koristite border-radius iz trenutne teme

source: Automatic Color Extraction
hr: Automatsko izvlačenje boja

source: Auto-detect colors on wallpaper change
hr: Automatski otkrij boje pri promjeni pozadine

source: Automatically extract and apply colors when you change your desktop background
hr: Automatski izvucite i primijenite boje kada promijenite pozadinu radne površine

source: Extract Colors Now
hr: Izvuci boje sada

source: Manually trigger color extraction from current wallpaper
hr: Ručno pokrenite izvlačenje boja iz trenutne pozadine

source: Extract from Wallpaper
hr: Izvuci iz pozadine

source: Manual Controls
hr: Ručne kontrole

source: Apply Changes Now
hr: Primijeni promjene sada

source: Manually update overlay theme (auto-update has 2s delay)
hr: Ručno ažurirajte temu prekrivanja (automatsko ažuriranje ima 2s kašnjenja)

source: Apply
hr: Primijeni

source: Overlay Update Triggered
hr: Pokrenuto ažuriranje prekrivanja

source: The theme overlay has been updated with your current settings.
hr: Tema prekrivanja je ažurirana s vašim trenutnim postavkama.

source: Recreate Overlay
hr: Ponovno stvori prekrivanje

source: Recreate
hr: Ponovno stvori

source: Overlay Recreation Triggered
hr: Pokrenuto ponovno stvaranje prekrivanja

source: The theme overlay is being completely rebuilt from the selected base theme.
hr: Tema prekrivanja se potpuno ponovno gradi iz odabrane osnovne teme.

source: Color Settings
hr: Postavke boja

source: Basic Transparency Controls
hr: Osnovne kontrole transparentnosti

source: Panel Opacity
hr: Neprozirnost panela

source: Adjust the transparency of the main panel (0.0 = fully transparent, 1.0 = fully opaque)
hr: Prilagodite transparentnost glavnog panela (0.0 = potpuno transparentno, 1.0 = potpuno neprozirno)

source: Menu Opacity
hr: Neprozirnost izbornika

source: Adjust the transparency of popup menus (0.0 = fully transparent, 1.0 = fully opaque)
hr: Prilagodite transparentnost skočnih izbornika (0.0 = potpuno transparentno, 1.0 = potpuno neprozirno)

source: Zorin Theme Tint Strength (%)
hr: Jačina nijanse Zorin teme (%)

source: Removes color tint from Zorin theme backgrounds (0% = fully neutral grey, 100% = original colored backgrounds). Only works with Zorin themes (ZorinBlue-Dark, ZorinGreen-Light, etc.). Other themes are unaffected.
hr: Uklanja nijanse boja iz pozadina Zorin tema (0% = potpuno neutralno siva, 100% = originalne obojene pozadine). Radi samo s Zorin temama (ZorinBlue-Dark, ZorinGreen-Light, itd.). Druge teme nisu pod utjecajem.

source: Panel Appearance
hr: Izgled panela

source: Panel Margin
hr: Margina panela

source: Horizontal spacing from screen edges (0 = pinned to edges, >0 = floating panel with modern appearance)
hr: Horizontalni razmak od rubova zaslona (0 = pričvršćen na rubove, >0 = plutajući panel s modernim izgledom)

source: Override panel color
hr: Nadjačaj boju panela

source: Use custom color for panel background instead of theme color
hr: Koristite prilagođenu boju za pozadinu panela umjesto boje teme

source: Choose override panel color
hr: Odaberite nadjačanu boju panela

source: Select background color for panel when override is enabled
hr: Odaberite boju pozadine za panel kada je nadjačavanje omogućeno

source: Override popup color
hr: Nadjačaj boju skočnih prozora

source: Use custom color for popup menu backgrounds
hr: Koristite prilagođenu boju za pozadine skočnih izbornika

source: Choose override popup color
hr: Odaberite nadjačanu boju skočnih prozora

source: Select background color for popup menus when override is enabled
hr: Odaberite boju pozadine za skočne izbornike kada je nadjačavanje omogućeno

source: Border Radius
hr: Radijus obruba

source: Rounded corners for panels and menus (0-25px)
hr: Zaobljeni kutovi za panele i izbornike (0-25px)

source: Blur Effects
hr: Efekti zamućenja

source: Custom Blur and Border Settings
hr: Prilagođene postavke zamućenja i obruba

source: Blur radius
hr: Radijus zamućenja

source: Controls the intensity of the blur effect
hr: Kontrolira intenzitet efekta zamućenja

source: Saturation multiplier
hr: Multiplikator zasićenosti

source: Adjusts color vibrancy in the blurred background
hr: Prilagođava živost boja u zamućenoj pozadini

source: Contrast multiplier
hr: Multiplikator kontrasta

source: Controls the difference between light and dark areas
hr: Kontrolira razliku između svijetlih i tamnih područja

source: Brightness multiplier
hr: Multiplikator svjetline

source: Modifies the overall lightness of the blurred layer
hr: Mijenja ukupnu svjetlinu zamućenog sloja

source: Background color/tint
hr: Boja pozadine/ton

source: Adds a tint overlay to the blur effect
hr: Dodaje ton prekrivanja efektu zamućenja

source: Border color
hr: Boja obruba

source: Sets the color of the subtle border framing the blurred elements
hr: Postavlja boju suptilnog obruba koji okružuje zamućene elemente

source: Border width
hr: Širina obruba

source: Defines the thickness of the border around blurred elements
hr: Definira debljinu obruba oko zamućenih elemenata

source: Blur opacity
hr: Neprozirnost zamućenja

source: Controls the transparency of the entire blur layer (0.0 = invisible blur, 1.0 = full blur effect)
hr: Kontrolira transparentnost cijelog sloja zamućenja (0.0 = nevidljivo zamućenje, 1.0 = potpuni efekt zamućenja)

source: Shadow Effects
hr: Efekti sjene

source: Shadow strength
hr: Jačina sjene

source: Controls outer glow spread around panels and menus (0.0 = no shadow, 0.8 = wide halo)
hr: Kontrolira širenje vanjskog sjaja oko panela i izbornika (0.0 = bez sjene, 0.8 = široki halo)

source: Shadow color
hr: Boja sjene

source: Sets the base color of shadows, automatically adjusted for light/dark themes
hr: Postavlja osnovnu boju sjena, automatski prilagođenu za svijetle/tamne teme

source: Advanced Settings
hr: Napredno

source: Interface Behavior
hr: Postavke sučelja

source: Hide system tray indicator
hr: Sakrij indikator u sistemskoj traci

source: Hide the transparency control icon from the system tray
hr: Sakrij ikonu kontrole transparentnosti iz sistemske trake

source: Enable notifications
hr: Uključi obavijesti

source: Show desktop notifications for theme changes, color extraction, and extension events
hr: Prikaži obavijesti na radnoj površini za promjene tema i ostale događaje ekstenzije

source: Zorin Menu Layout Style
hr: Način prikaza Zorin Izbornika

source: Standard Zorin (categories+apps+sidebar), Mint Style (hover), Grid View, Apps Only, or Shortcuts Only
hr: Standardni Zorin (kategorije + aplikacije + bočna traka), Mint stil (hover), Prikaz u mreži, Samo aplikacije ili Samo prečaci

source: ⚠️ Zorin Menu extension not installed or not enabled. Enable it first to use this feature.
hr: ⚠️ Zorin Menu ekstenzija nije instalirana ili omogućena. Najprije je omogućite kako biste koristili ovu značajku.

source: Automation
hr: Automatizacija

source: Auto-switch between Light/Dark variants
hr: Automatski prebacuj teme između svijetlih i tamnih varijanti

source: Monitors Quick Settings Dark/Light toggle and automatically switches to matching theme variant (e.g., ZorinPurple-Light ↔ ZorinPurple-Dark). Also filters dropdown to show only matching themes.
hr: Prati prekidač Dark/Light u Brzim postavkama i automatski prebacuje na odgovarajuću varijantu teme (npr. ZorinPurple-Light ↔ ZorinPurple-Dark). Također filtrira padajući izbornik da prikazuje samo odgovarajuće teme.

source: How It Works
hr: Kako radi

source: When enabled: Quick Settings toggle automatically switches your theme between -Dark and -Light variants. Dropdown shows only themes matching current appearance. When disabled: Manual theme selection, all themes shown.
hr: Kada je omogućeno: prekidač u Brzim postavkama automatski prebacuje temu između -Dark i -Light varijanti. Padajući izbornik prikazuje samo teme koje odgovaraju trenutnom izgledu. Kada je onemogućeno: ručni odabir teme, prikazane sve teme.

source: Full Auto Mode
hr: Potpuno automatski način

source: Experimental: Wallpaper extraction controls ALL colors including blur effects (border, background, shadow). When disabled, theme controls blur effects while wallpaper controls panel/popup.
hr: Eksperimentalno: Izvlačenje pozadine kontrolira SVE boje uključujući efekte zamućenja (obrub, pozadina, sjena). Kada je onemogućeno, tema kontrolira efekte zamućenja dok pozadina kontrolira panel/skočni prozor.

source: Standard: Theme accent + Wallpaper backgrounds | Full Auto: Wallpaper controls everything
hr: Standardno: Naglasak teme + Pozadine pozadine | Potpuno automatski: Pozadina kontrolira sve

source: Debugging
hr: Otklanjanje grešaka

source: Enable debug logging
hr: Omogući zapisivanje otklanjanja grešaka

source: Enable detailed logging for troubleshooting extension issues
hr: Omogući detaljno zapisivanje za rješavanje problema s ekstenzijom

source: About
hr: Informacije

source: CSS Gnommé - Dynamic GTK Theme Overlay for Zorin OS
hr: CSS Gnommé - Dinamično prekrivanje GTK Tema za Zorin OS

source: Version
hr: Verzija

source: Author
hr: Autor

source: Developed for Zorin OS 18+ (GNOME Shell 46+), inspired by Cinnamon CSS Panels and gnome Open Bar extensions.
hr: Razvijeno za Zorin OS 18+ (GNOME Shell 46+), inspirirano Cinnamon CSS panelima i gnome Open Bar ekstenzijama.

source: Overlay Theme System
hr: Sistem teme prekrivanja

source: Creates a dynamic overlay at ~/.themes/CSSGnomme/ that sits on top of your current theme via @import. Fully reversible, doesn't modify original theme files.
hr: Stvara dinamičko prekrivanje u ~/.themes/CSSGnomme/ koje se nalazi iznad vaše trenutne teme putem @import. Potpuno reverzibilno, ne mijenja originalne datoteke teme.

source: Analyzes wallpaper using K-means clustering, extracts dominant and accent colors, applies darker variants to panels and brighter variants to menus. Triggers on wallpaper change or manually.
hr: Analizira pozadinu koristeći K-means grupiranje, izvlači dominantne i naglašene boje, primjenjuje tamnije varijante na panele i svjetlije varijante na izbornike. Pokreće se pri promjeni pozadine ili ručno.

source: Advanced Blur Effects
hr: Napredni efekti zamućenja

source: Uses CSS backdrop-filter for frosted glass appearance. All settings (radius, saturate, contrast, brightness) dynamically read from preferences. Applies to menus, Alt+Tab, and shell elements.
hr: Koristi CSS backdrop-filter za izgled zamrznutog stakla. Sve postavke (radijus, zasićenost, kontrast, svjetlina) dinamički se čitaju iz postavki. Primjenjuje se na izbornike, Alt+Tab i elemente ljuske.

source: Zorin OS Integration
hr: Integracija Zorin OS-a

source: Enhanced styling for Zorin Taskbar and panels. Note: Window Preview uses inline JavaScript styles that override CSS.
hr: Poboljšani stil za Zorin traku zadataka i panele. Napomena: Pregled prozora koristi inline JavaScript stilove koji nadjačavaju CSS.

source: What Gets Styled
hr: Što se stilizira

source: GNOME Shell panel, Zorin taskbar, popup menus, Alt+Tab switcher, Quick Settings, notifications, OSD, and Dash. GTK3/GTK4 apps inherit base theme with optional overrides.
hr: GNOME Shell panel, Zorin traka zadataka, skočni izbornici, Alt+Tab prebacivač, Brze postavke, obavijesti, OSD i Dash. GTK3/GTK4 aplikacije nasljeđuju osnovnu temu s opcionalnim nadjačavanjima.

source: Known Limitations
hr: Poznata ograničenja

source: Theme switching: Flicker on theme refresh (older hardware). Window Preview: Zorin Taskbar uses inline JavaScript styles that override CSS. Wayland: Shell restart requires logout. Performance: Heavy blur (radius > 40px) may impact older GPUs.
hr: Prebacivanje tema: Treperenje pri osvježavanju teme (stariji hardware). Pregled prozora: Zorin traka zadataka koristi inline JavaScript stilove koji nadjačavaju CSS. Wayland: Ponovno pokretanje ljuske zahtijeva odjavu. Performanse: Teško zamućenje (radijus > 40px) može utjecati na starije GPU-ove.
